zephyrproject-rtos/hal_stm32/lib/stm32wba/IEEE802154/System/Config/Debug_GPIO/debug_config.h
#define USE_RT_DEBUG_CONN_MNGR_UPDT_CONN_PARAM_CBK            (0)
#define GPIO_DEBUG_CONN_MNGR_UPDT_CONN_PARAM_CBK              {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_EVNT_SCHDLR_HW_EVNT_CMPLT                (0)
#define GPIO_DEBUG_EVNT_SCHDLR_HW_EVNT_CMPLT                  {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_HCI_EVENT_HNDLR                          (0)
#define GPIO_DEBUG_HCI_EVENT_HNDLR                            {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_MLME_TMRS_CBK                            (0)
#define GPIO_DEBUG_MLME_TMRS_CBK                              {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_DIRECT_TX_EVNT_CBK                       (0)
#define GPIO_DEBUG_DIRECT_TX_EVNT_CBK                         {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_INDIRECT_PKT_TOUR_CBK                    (0)
#define GPIO_DEBUG_INDIRECT_PKT_TOUR_CBK                      {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RADIO_CSMA_TMR                           (0)
#define GPIO_DEBUG_RADIO_CSMA_TMR                             {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_SM_DONE_EVNT_CBK                     (0)
#define GPIO_DEBUG_RAL_SM_DONE_EVNT_CBK                       {GPIOB, GPIO_PIN_4}

#define USE_RT_DEBUG_ED_TMR_HNDL                              (0)
#define GPIO_DEBUG_ED_TMR_HNDL                                {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_OS_TMR_EVNT_CBK                          (0)
#define GPIO_DEBUG_OS_TMR_EVNT_CBK                            {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_PROFILE_MARKER_PHY_WAKEUP_TIME           (0)
#define GPIO_DEBUG_PROFILE_MARKER_PHY_WAKEUP_TIME             {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_PROFILE_END_DRIFT_TIME                   (0)
#define GPIO_DEBUG_PROFILE_END_DRIFT_TIME                     {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_PROC_RADIO_RCV                           (0)
#define GPIO_DEBUG_PROC_RADIO_RCV                             {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_EVNT_TIME_UPDT                           (0)
#define GPIO_DEBUG_EVNT_TIME_UPDT                             {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_MAC_RECEIVE_DONE                         (0)
#define GPIO_DEBUG_MAC_RECEIVE_DONE                           {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_MAC_TX_DONE                              (0)
#define GPIO_DEBUG_MAC_TX_DONE                                {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RADIO_APPLY_CSMA                         (0)
#define GPIO_DEBUG_RADIO_APPLY_CSMA                           {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RADIO_TRANSMIT                           (0)
#define GPIO_DEBUG_RADIO_TRANSMIT                             {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_PROC_RADIO_TX                            (0)
#define GPIO_DEBUG_PROC_RADIO_TX                              {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_TX_DONE                              (0)
#define GPIO_DEBUG_RAL_TX_DONE                                {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_TX_DONE_INCREMENT_BACKOFF_COUNT      (0)
#define GPIO_DEBUG_RAL_TX_DONE_INCREMENT_BACKOFF_COUNT        {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_TX_DONE_RST_BACKOFF_COUNT            (0)
#define GPIO_DEBUG_RAL_TX_DONE_RST_BACKOFF_COUNT              {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_CONTINUE_RX                          (0)
#define GPIO_DEBUG_RAL_CONTINUE_RX                            {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_PERFORM_CCA                          (0)
#define GPIO_DEBUG_RAL_PERFORM_CCA                            {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_RAL_ENABLE_TRANSMITTER                   (0)
#define GPIO_DEBUG_RAL_ENABLE_TRANSMITTER                     {GPIOA, GPIO_PIN_0}

#define USE_RT_DEBUG_LLHWC_GET_CH_IDX_ALGO_2                  (0)
#define GPIO_DEBUG_LLHWC_GET_CH_IDX_ALGO_2                    {GPIOA, GPIO_PIN_0}

/* Application signal selection and GPIO assignment.
   CAN BE MODIFIED BY USER */

#define USE_RT_DEBUG_APP_APPE_INIT                            (0)
#define GPIO_DEBUG_APP_APPE_INIT                              {GPIOA, GPIO_PIN_0}

/********************************/
/** Debug configuration setup **/
/*******************************/

/*
 *
 * Debug configuration for System purpose
 *
 */
#if (USE_RT_DEBUG_CONFIGURATION_SYSTEM == 1U)
/* SCM_SETUP activation */
#undef USE_RT_DEBUG_SCM_SETUP
#define USE_RT_DEBUG_SCM_SETUP                                (1U)

/* SCM_SYSTEM_CLOCK_CONFIG activation */
#undef USE_RT_DEBUG_SCM_SYSTEM_CLOCK_CONFIG
#define USE_RT_DEBUG_SCM_SYSTEM_CLOCK_CONFIG                  (1U)

/* SCM_HSERDY_ISR activation */
#undef USE_RT_DEBUG_SCM_HSERDY_ISR
#define USE_RT_DEBUG_SCM_HSERDY_ISR                           (1U)

/* LOW_POWER_STOP_MODE_ACTIVE activation */
#undef USE_RT_DEBUG_LOW_POWER_STOP_MODE_ACTIVE
#define USE_RT_DEBUG_LOW_POWER_STOP_MODE_ACTIVE               (1U)

/* ADC_ACTIVATION activation */
#undef USE_RT_DEBUG_ADC_ACTIVATION
#define USE_RT_DEBUG_ADC_ACTIVATION                           (1U)

/* ADC_TEMPERATURE_ACQUISITION activation */
#undef USE_RT_DEBUG_ADC_TEMPERATURE_ACQUISITION
#define USE_RT_DEBUG_ADC_TEMPERATURE_ACQUISITION              (1U)

/* RNG_GEN_RAND_NUM activation */
#undef USE_RT_DEBUG_RNG_GEN_RAND_NUM
#define USE_RT_DEBUG_RNG_GEN_RAND_NUM                         (1U)

/* LOW_POWER_STANDBY_MODE_ACTIVE activation */
#undef USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_ACTIVE
#define USE_RT_DEBUG_LOW_POWER_STANDBY_MODE_ACTIVE            (1U)

/*
 *
 * Debug configuration for BLE purpose
 *
 */
#elif (USE_RT_DEBUG_CONFIGURATION_BLE == 1U)

/* LLHWC_CMN_LW_ISR activation */
#undef USE_RT_DEBUG_LLHWC_CMN_LW_ISR
#define USE_RT_DEBUG_LLHWC_CMN_LW_ISR                         (1U)

/* LLHWC_CMN_HG_ISR activation */
#undef USE_RT_DEBUG_LLWCC_CMN_HG_ISR
#define USE_RT_DEBUG_LLWCC_CMN_HG_ISR                         (1U)

/* PHY_CLBR_EXEC activation */
#undef USE_RT_DEBUG_PHY_CLBR_EXEC
#define USE_RT_DEBUG_PHY_CLBR_EXEC                            (1U)

/* SCHDLR_EVNT_RGSTR activation */
#undef USE_RT_DEBUG_SCHDLR_EVNT_RGSTR
#define USE_RT_DEBUG_SCHDLR_EVNT_RGSTR                        (1U)

/* SCHDLR_HNDL_MISSED_EVNT activation */
#undef USE_RT_DEBUG_SCHDLR_HNDL_MISSED_EVNT
#define USE_RT_DEBUG_SCHDLR_HNDL_MISSED_EVNT                  (1U)

